pages/8_Lesson.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>An Introduction to Mechanisms</title>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="css/styles.css"/>
<link href='http://fonts.googleapis.com/css?family=Ubuntu+Mono|Ubuntu' rel='stylesheet' type='text/css'>
</head>
<body>
<div id="content">
<h1 class="title">An Introduction to Mechanisms</h1>
<div class="github-fork-ribbon-wrapper left">
        <div class="github-fork-ribbon">
            <a href="https://github.com/MarcScott/7-SC-Mechanisms">Fork me on GitHub</a>
        </div>
    </div>
    <div class="github-fork-ribbon-wrapper right-bottom">
        <div class="github-fork-ribbon">
            <a href="../index.html">Back to Index</a>
        </div>
    </div>
<div id="stickyribbon">
    <ul>
      <li><a href="1_Lesson.html">Week1</a></li>
      <li><a href="2_Lesson.html">Week2</a></li>
      <li><a href="3_Lesson.html">Week3</a></li>
      <li><a href="4_Lesson.html">Week4</a></li>
      <li><a href="5_Lesson.html">Week5</a></li>
      <li><a href="6_Lesson.html">Week6</a></li>
      <li><a href="7_Lesson.html">Week7</a></li>
      <li><a href="8_Lesson.html">Week8</a></li>

      <li><a href="assessment.html">Assessment</a></li>
    </ul>
  </div>

<div id="outline-container-sec-1" class="outline-2 activity">
<h2 id="sec-1"><span class="section-number-2">1</span> Making your automata - Solidworks</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-sec-1-1" class="outline-3 learn">
<h3 id="sec-1-1">Learn It</h3>
<div class="outline-text-3" id="text-1-1">
<p>
To make your own automata using <b>Solidworks</b> there are a number of skills that you need to 
be able to master.
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3 badge">
<h3 id="sec-1-2">Learn It - Changing an existing part</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Right click on the part, in the assembly, select the edit sketch/pencil icon in top right. 
</li>
<li>Below is a video to help
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/JCaKbu4BNWQ" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3 badge">
<h3 id="sec-1-3">Learn It - Autotrace</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>From the toolbar at the top make sure you go to tools &gt; Add-ins and enable autotrace with the <b>two</b> checkboxes.
</li>
<li>Go to google images and find a suitable image and save it
</li>
<li>In Solidworks start a new part. 
</li>
<li>Click on sketch then select a plane
</li>
<li>Go to the commands search bar an type in 'Sketch picture'
</li>
<li>Select your saved image
</li>
<li>Carefully change the size - <b>Note</b> Your frame is 100mm wide.
</li>
<li>In the left sidebar - cick the right arrow 
</li>
<li>Select the dropper tool and then click on your image
</li>
<li>Begin trace
</li>
<li>Adjust your image.
</li>
<li>Tidy up sketch by adding lines and trimming off spares.
</li>
<li>Extrude to 3mm
</li>
<li>Below is a video to help
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/EOUJDC0BJJk" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3 badge">
<h3 id="sec-1-4">Learn It - Converting a Solidworks part into a DXF file</h3>
<div class="outline-text-3" id="text-1-4">

<ul class="org-ul">
<li>Make sure the part is flat or front on.
</li>
<li>Right click on the part. 
</li>
<li>Choose convert into a DXF file.
</li>
<li>Select options and make sure 'polylines' is selected.
</li>
<li>Save
</li>
<li>Select annotation view and green tick to select.
</li>
<li>From the black and white preview save the file.
</li>
<li>Repeat with all your parts that you need to cut.
</li>
<li>Below is a video to help
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/tCrKIf2MbrI" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3 badge">
<h3 id="sec-1-5">Learn It - Import a DXF file into 2D Design</h3>
<div class="outline-text-3" id="text-1-5">
<ul class="org-ul">
<li>Open 2D Design.
</li>
<li>From the top menu go to File &gt; Import File
</li>
<li>Select your file.
</li>
<li>Make sure it is in 'mm' and ignore the warnings.
</li>
<li>Change the lines to red and move into the corner.
</li>
<li>Below is a video to help
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/NEu4DCv8zLo" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3 badge">
<h3 id="sec-1-6">Learn It - Final checks and send to the lasercutter</h3>
<div class="outline-text-3" id="text-1-6">
<ul class="org-ul">
<li>Firstly make sure your file is saved with a suitable name. 
</li>
<li>Next check all parts are squashed together, to save material and labelled if necessary.
</li>
<li>Then go to Outlook – should be a link on the bottom toolbar in Windows – big O. Click on new. Type the address lasercutter and then check names. Attach the file and send it. 
</li>
<li>Below is a video to help
</li>
</ul>
<iframe width="560" height="315" src="https://www.youtube.com/embed/mtbspqEoJxw" frameborder="0" allow="accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3 badge">
<h3 id="sec-1-7">Badge It - Silver, Gold and Platinum</h3>
<div class="outline-text-3" id="text-1-7">
<ul class="org-ul">
<li>For silver add screenshots of your new parts.
</li>
<li>For gold add a cutting sheet
</li>
<li>For platinum, upload a photo of your finished automata.
</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="validation"></p>
</div>
</body>
</html>
